[
  {
    "id": "maroon_heritage",
    "title": "Maroon Heritage",
    "description": "The Jamaican Maroons are descendants of Africans who escaped slavery during Spanish and British colonial rule, forming autonomous communities in Jamaica’s mountainous interior. These groups—most famously in Moore Town and Accompong—negotiated treaties with the British in the 18th century, securing land and self-governance. Maroon culture blends West and Central African traditions, including the Kromanti language, spiritual ceremonies, and the use of the abeng horn for communication.",
    "mapURL": "https://maps.apple.com/?q=Moore+Town,+Jamaica"
  },
  {
    "id": "jerk_cuisine",
    "title": "Jerk Cuisine",
    "description": "Jerk cooking is a fiery, flavorful tradition rooted in Maroon resistance. It blends African seasoning techniques with indigenous Taino methods, using pimento wood and Scotch bonnet peppers to create smoky, spicy meats. Boston Bay in Portland is considered the birthplace of jerk, where roadside pits still serve up authentic chicken and pork.",
    "mapURL": "https://maps.apple.com/?q=Boston+Bay,+Jamaica"
  },
  {
    "id": "rastafari_movement",
    "title": "Rastafari Movement",
    "description": "Emerging in the 1930s, Rastafari is a spiritual and cultural movement that reveres Haile Selassie I of Ethiopia as divine. It promotes African identity, resistance to oppression, and a return to roots. Rastafari has shaped Jamaican music, language, and global consciousness—especially through reggae and icons like Bob Marley.",
    "mapURL": "https://maps.apple.com/?q=Trench+Town,+Jamaica"
  },
  {
    "id": "dancehall_music",
    "title": "Dancehall Music",
    "description": "Dancehall evolved from reggae in the late 1970s, bringing faster rhythms, digital instrumentation, and bold lyrical styles. It reflects urban life, fashion, and social commentary, often performed in sound system clashes and street parties.",
    "mapURL": "https://maps.apple.com/?q=Kingston,+Jamaica"
  },
  {
    "id": "blue_mountain_coffee",
    "title": "Blue Mountain Coffee",
    "description": "Grown in the misty peaks of the Blue Mountains, this coffee is prized for its mild flavor and lack of bitterness. It’s one of the most sought-after and expensive coffees in the world, with strict export regulations and a rich farming tradition.",
    "mapURL": "https://maps.apple.com/?q=Blue+Mountains,+Jamaica"
  },
  {
    "id": "jamaican_patois",
    "title": "Jamaican Patois",
    "description": "Jamaican Patois is a vibrant Creole language that blends English with West African syntax and vocabulary. It’s a powerful tool of identity and resistance, used in music, storytelling, and everyday conversation.",
    "mapURL": "https://maps.apple.com/?q=Jamaica"
  },
  {
    "id": "reggae_music",
    "title": "Reggae Music",
    "description": "Reggae emerged in the 1960s as a voice for the oppressed, blending ska, rocksteady, and Rastafari themes. It became a global movement through artists like Bob Marley, Peter Tosh, and Burning Spear.",
    "mapURL": "https://maps.apple.com/?q=Nine+Mile,+Jamaica"
  },
  {
    "id": "jamaican_festivals",
    "title": "Jamaican Festivals",
    "description": "From Carnival to Independence Day, Jamaica’s festivals celebrate music, dance, food, and national pride. Events like Reggae Sumfest and Accompong Maroon Festival showcase the island’s cultural diversity and resilience.",
    "mapURL": "https://maps.apple.com/?q=Montego+Bay,+Jamaica"
  }
]
